laravel/app/Http/Controllers/ArticleController.php

    public function index()
    {
        $articles = Article::all()->sortByDesc('created_at');
---
select * from "articles"

    public function like(Request $request, Article $article)
    {
        $article->likes()->detach($request->user()->id);
        $article->likes()->attach($request->user()->id);
---
delete from "likes" where "article_id" = 49 and "user_id" in (3)
insert into "likes" ("article_id", "created_at", "updated_at", "user_id") values (49, '2021-03-24 12:55:49', '2021-03-24 12:55:49', 3)

    public function unlike(Request $request, Article $article)
    {
        $article->likes()->detach($request->user()->id);
---
delete from "likes" where "article_id" = 47 and "user_id" in (3)